
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5093253403)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063b5de1a8e57c2f0]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09bbe5d247799c91a]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ac5af99053517d53]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f444d3d84593377a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02fded69eeafebfbb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01847c06253f6a5a3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038a3874d394ce238]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0094caf37924ecc1c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0643033702df490c6]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06780cdb2f9d2ac42]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b8049beb4cc0f4d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d1f14784708f5dea]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9321dd4a0f03441]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0708ee74755483bb1]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0df4a6dc79f929b2b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008b3aa7a98eb2dd6]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0708ee74755483bb11080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c26045e1e6dc22eb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d77837d9b95e446b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e98de56a761ff0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0775f5db85f86ab62]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0094caf37924ecc1c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0643033702df490c61080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0ac5af99053517d53"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0ac5af99053517d53"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 5s [id=sg-01817104820a1c119]
aws_security_group.alb: Creation complete after 6s [id=sg-06b0acbe1b5245215]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-1996458343]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"2d9343da21e5650f5a6b9601b6519f4c6fc249a2","Vars":{},"WorkflowName":"Terraform"} -->